espressif/esp-adf/examples/player/pipeline_living_stream/sdkconfig.defaults.esp32c6

#
# Default config
#
CONFIG_IDF_TARGET_ARCH_RISCV=y
CONFIG_IDF_TARGET_ARCH="riscv"
CONFIG_IDF_TARGET="esp32c6"
CONFIG_IDF_TARGET_ESP32C6=y
CONFIG_IDF_FIRMWARE_CHIP_ID=0x000D

#
# Audio HAL
#
CONFIG_ESP32_C6_DEVKIT_BOARD=y
